linked-data-outline.org
Linked Data and REST part 1
* DONE Linked Data and REST
  CLOCK: [2014-03-03 Mon 19:47]--[2014-03-03 Mon 20:00] =>  0:13
  CLOCK: [2014-03-03 Mon 18:46]--[2014-03-03 Mon 19:11] =>  0:25
  CLOCK: [2014-03-03 Mon 18:38]--[2014-03-03 Mon 18:44] =>  0:06
  CLOCK: [2014-03-03 Mon 18:04]--[2014-03-03 Mon 18:29] =>  0:25
** DONE What is this

For those who don't know me, I am Eric Moritz.  

I am the architect on the application services team.

Application services sit on the public web between our backends and user facing
applications.

Applications such as desktop web, mobile web and native mobile apps.

Because of their nature, application services have some very strict requirements.

First, we must to be able to iterate as fast as frontend developers
demand of us.

Second, because these services are used by multiple applications, 
they must evolve without disturbing other applications.

These requirements pose a challenge.

Current approaches to RESTful services do not meet these requirements.

Some research was obviously needed in order to build application services.

This talk is my journey meet the requirements of application services.

** DONE A journey through time and space

Let me take you on a journey through time and space.  

The time? sometime around 2005.  

The place, your desk. 

You're reading a blog post on RESTful services for the first time.  

You read of a grand utopia.

One service can drive many user interfaces!  

Developers can iterate quickly without disruption!

Things just work!  

You go to bed that night, finally able to REST 

knowing that there is a brave new world coming.

Fast forward to today.  

We are all building RESTful services.

We are in the brave new world. 

But this world is more dystopian than utopian. 

Servers are tightly coupled to single applications.

Developers are stuck with stiff and rigid data formats.

We try to REST, but we lose too much sleep over broken software
and we still dream of a better world.

Where did we go wrong? 

Lets travel to the time and place were REST was first made public.

** DONE In the year 2000

We travel back to the year 2000.

Roy T Fielding is publishing his dissertation on the architecture of the world wide web.

In his dissertation, he states the requirements of a web application.

** DONE Low Entry-barrier

First, there must be a low barrier to entry. 

Hypermedia was chosen as the user interface for its simplicity and generality.

In order to have a low barrier to entry, the data format must be
simple.

Frontend developers must be able to mock the hypermedia service
with static files just as easily as they can with HTML.

The data format of application services must be general enough to
drive both native apps and web sites.

** DONE Extensibility

If a service is driving both native apps and web sites, the
technology *must* be extensible.

We must be able to evolve the service without disturbing other user agents.

If the mobile app team wants feature X, adding feature X must not
break desktop web.

If we can't do that we are not meeting this requirement of an
application service.

** DONE Low time to interaction
*** DONE Slide
