linked-data-outline.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Linked Data and REST part 1</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Linked Data and REST part 1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-03-03T21:45-0500"/>
<meta name="author" content="Moritz"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Linked Data and REST part 1</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Linked Data and REST</a>
<ul>
<li><a href="#sec-1-1">1.1 What is this</a></li>
<li><a href="#sec-1-2">1.2 A journey through time and space</a></li>
<li><a href="#sec-1-3">1.3 In the year 2000</a></li>
<li><a href="#sec-1-4">1.4 Low Entry-barrier</a></li>
<li><a href="#sec-1-5">1.5 Extensibility</a></li>
<li><a href="#sec-1-6">1.6 Low time to interaction</a>
<ul>
<li><a href="#sec-1-6-1">1.6.1 Slide</a></li>
<li><a href="#sec-1-6-2">1.6.2 Text</a></li>
</ul>
</li>
<li><a href="#sec-1-7">1.7 Internet-scale</a>
<ul>
<li><a href="#sec-1-7-1">1.7.1 Slides</a></li>
<li><a href="#sec-1-7-2">1.7.2 Text</a></li>
</ul>
</li>
<li><a href="#sec-1-8">1.8 Summary</a></li>
<li><a href="#sec-1-9">1.9 A true web application</a>
<ul>
<li><a href="#sec-1-9-1">1.9.1 Slides</a></li>
<li><a href="#sec-1-9-2">1.9.2 Text</a></li>
</ul>
</li>
<li><a href="#sec-1-10">1.10 Computer says no.</a>
<ul>
<li><a href="#sec-1-10-1">1.10.1 Slides</a></li>
<li><a href="#sec-1-10-2">1.10.2 Text</a></li>
</ul>
</li>
<li><a href="#sec-1-11">1.11 View Source</a>
<ul>
<li><a href="#sec-1-11-1">1.11.1 Slides</a></li>
<li><a href="#sec-1-11-2">1.11.2 Text</a></li>
</ul>
</li>
<li><a href="#sec-1-12">1.12 If these are the requirements</a>
<ul>
<li><a href="#sec-1-12-1">1.12.1 Slide</a></li>
<li><a href="#sec-1-12-2">1.12.2 Text</a></li>
</ul>
</li>
<li><a href="#sec-1-13">1.13 What is state?</a>
<ul>
<li><a href="#sec-1-13-1">1.13.1 Slide</a></li>
<li><a href="#sec-1-13-2">1.13.2 Text</a></li>
</ul>
</li>
<li><a href="#sec-1-14">1.14 Choosing the wrong data model</a>
<ul>
<li><a href="#sec-1-14-1">1.14.1 Slides</a></li>
<li><a href="#sec-1-14-2">1.14.2 Text</a></li>
</ul>
</li>
<li><a href="#sec-1-15">1.15 What can let us REST?</a>
<ul>
<li><a href="#sec-1-15-1">1.15.1 Slides</a></li>
<li><a href="#sec-1-15-2">1.15.2 Text</a></li>
</ul>
</li>
<li><a href="#sec-1-16">1.16 Can JSON let us REST?</a>
<ul>
<li><a href="#sec-1-16-1">1.16.1 Slides</a></li>
<li><a href="#sec-1-16-2">1.16.2 Text</a></li>
</ul>
</li>
<li><a href="#sec-1-17">1.17 Can CSV let us REST?</a>
<ul>
<li><a href="#sec-1-17-1">1.17.1 Slides</a></li>
<li><a href="#sec-1-17-2">1.17.2 Text</a></li>
</ul>
</li>
<li><a href="#sec-1-18">1.18 Can XML let us REST?</a>
<ul>
<li><a href="#sec-1-18-1">1.18.1 Slides</a></li>
<li><a href="#sec-1-18-2">1.18.2 Text</a></li>
</ul>
</li>
<li><a href="#sec-1-19">1.19 Can HTML5 let us REST?</a>
<ul>
<li><a href="#sec-1-19-1">1.19.1 Slides</a></li>
<li><a href="#sec-1-19-2">1.19.2 Text</a></li>
</ul>
</li>
<li><a href="#sec-1-20">1.20 Can RDFa+HTML5 let us REST?</a>
<ul>
<li><a href="#sec-1-20-1">1.20.1 Slides</a></li>
<li><a href="#sec-1-20-2">1.20.2 Text</a></li>
</ul>
</li>
<li><a href="#sec-1-21">1.21 Can RDF let us REST?</a>
<ul>
<li><a href="#sec-1-21-1">1.21.1 Slides</a></li>
<li><a href="#sec-1-21-2">1.21.2 Talk</a></li>
</ul>
</li>
<li><a href="#sec-1-22">1.22 A wild Hydra appears!</a>
<ul>
<li><a href="#sec-1-22-1">1.22.1 Slides</a></li>
<li><a href="#sec-1-22-2">1.22.2 Text</a></li>
</ul>
</li>
<li><a href="#sec-1-23">1.23 Not XML; please god no!</a>
<ul>
<li><a href="#sec-1-23-1">1.23.1 Slides</a></li>
<li><a href="#sec-1-23-2">1.23.2 Text</a></li>
</ul>
</li>
<li><a href="#sec-1-24">1.24 Triples?</a>
<ul>
<li><a href="#sec-1-24-1">1.24.1 Slide</a></li>
<li><a href="#sec-1-24-2">1.24.2 Text</a></li>
</ul>
</li>
<li><a href="#sec-1-25">1.25 RDF is a graph 1</a>
<ul>
<li><a href="#sec-1-25-1">1.25.1 Slide</a></li>
<li><a href="#sec-1-25-2">1.25.2 Text</a></li>
</ul>
</li>
<li><a href="#sec-1-26">1.26 RDF is a graph 2</a>
<ul>
<li><a href="#sec-1-26-1">1.26.1 Slide</a></li>
<li><a href="#sec-1-26-2">1.26.2 Text</a></li>
</ul>
</li>
<li><a href="#sec-1-27">1.27 Can we finally get some REST?</a>
<ul>
<li><a href="#sec-1-27-1">1.27.1 Slide</a></li>
<li><a href="#sec-1-27-2">1.27.2 Text</a></li>
</ul>
</li>
<li><a href="#sec-1-28">1.28 JSON-LD</a>
<ul>
<li><a href="#sec-1-28-1">1.28.1 Slide</a></li>
<li><a href="#sec-1-28-2">1.28.2 Text</a></li>
</ul>
</li>
<li><a href="#sec-1-29">1.29 Linked Data</a>
<ul>
<li><a href="#sec-1-29-1">1.29.1 Slides</a></li>
<li><a href="#sec-1-29-2">1.29.2 Text</a></li>
</ul>
</li>
<li><a href="#sec-1-30">1.30 Shared Vocabulary</a>
<ul>
<li><a href="#sec-1-30-1">1.30.1 Slide</a></li>
<li><a href="#sec-1-30-2">1.30.2 Text</a></li>
</ul>
</li>
<li><a href="#sec-1-31">1.31 Shared Vocabulary 2</a>
<ul>
<li><a href="#sec-1-31-1">1.31.1 Slide</a></li>
<li><a href="#sec-1-31-2">1.31.2 Text</a></li>
</ul>
</li>
<li><a href="#sec-1-32">1.32 Shared Vocabulary 3</a>
<ul>
<li><a href="#sec-1-32-1">1.32.1 Slide</a></li>
<li><a href="#sec-1-32-2">1.32.2 Text</a></li>
</ul>
</li>
<li><a href="#sec-1-33">1.33 Shared Vocabulary 3</a>
<ul>
<li><a href="#sec-1-33-1">1.33.1 slide</a></li>
<li><a href="#sec-1-33-2">1.33.2 Text</a></li>
</ul>
</li>
<li><a href="#sec-1-34">1.34 With Linked Data</a>
<ul>
<li><a href="#sec-1-34-1">1.34.1 Slide</a></li>
<li><a href="#sec-1-34-2">1.34.2 Text</a></li>
</ul>
</li>
<li><a href="#sec-1-35">1.35 We can finally get some REST</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <span class="done DONE">DONE</span> Linked Data and REST</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> <span class="done DONE">DONE</span> What is this</h3>
<div class="outline-text-3" id="text-1-1">


<p>
For those who don't know me, I am Eric Moritz.  
</p>
<p>
I am the architect on the application services team.
</p>
<p>
Application services sit on the public web between our backends and user facing
applications.
</p>
<p>
Applications such as desktop web, mobile web and native mobile apps.
</p>
<p>
Because of their nature, application services have some very strict requirements.
</p>
<p>
First, we must to be able to iterate as fast as frontend developers
demand of us.
</p>
<p>
Second, because these services are used by multiple applications, 
they must evolve without disturbing other applications.
</p>
<p>
These requirements pose a challenge.
</p>
<p>
Current approaches to RESTful services do not meet these requirements.
</p>
<p>
Some research was obviously needed in order to build application services.
</p>
<p>
This talk is my journey meet the requirements of application services.
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> <span class="done DONE">DONE</span> A journey through time and space</h3>
<div class="outline-text-3" id="text-1-2">


<p>
Let me take you on a journey through time and space.  
</p>
<p>
The time? sometime around 2005.  
</p>
<p>
The place, your desk. 
</p>
<p>
You're reading a blog post on RESTful services for the first time.  
</p>
<p>
You read of a grand utopia.
</p>
<p>
One service can drive many user interfaces!  
</p>
<p>
Developers can iterate quickly without disruption!
</p>
<p>
Things just work!  
</p>
<p>
You go to bed that night, finally able to REST 
</p>
<p>
knowing that there is a brave new world coming.
</p>
<p>
Fast forward to today.  
</p>
<p>
We are all building RESTful services.
</p>
<p>
We are in the brave new world. 
</p>
<p>
But this world is more dystopian than utopian. 
</p>
<p>
Servers are tightly coupled to single applications.
</p>
<p>
Developers are stuck with stiff and rigid data formats.
</p>
<p>
We try to REST, but we lose too much sleep over broken software
and we still dream of a better world.
</p>
<p>
Where did we go wrong? 
</p>
<p>
Lets travel to the time and place were REST was first made public.
</p>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> <span class="done DONE">DONE</span> In the year 2000</h3>
<div class="outline-text-3" id="text-1-3">


<p>
We travel back to the year 2000.
</p>
<p>
Roy T Fielding is publishing his dissertation on the architecture of the world wide web.
</p>
<p>
In his dissertation, he states the requirements of a web application.
</p>
</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> <span class="done DONE">DONE</span> Low Entry-barrier</h3>
<div class="outline-text-3" id="text-1-4">


<p>
First, there must be a low barrier to entry. 
</p>
<p>
Hypermedia was chosen as the user interface for its simplicity and generality.
</p>
<p>
In order to have a low barrier to entry, the data format must be
simple.
</p>
<p>
Frontend developers must be able to mock the hypermedia service
with static files just as easily as they can with HTML.
</p>
<p>
The data format of application services must be general enough to
drive both native apps and web sites.
</p>
</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> <span class="done DONE">DONE</span> Extensibility</h3>
<div class="outline-text-3" id="text-1-5">


<p>
If a service is driving both native apps and web sites, the
technology <b>must</b> be extensible.
</p>
<p>
We must be able to evolve the service without disturbing other user agents.
</p>
<p>
If the mobile app team wants feature X, adding feature X must not
break desktop web.
</p>
<p>
If we can't do that we are not meeting this requirement of an
application service.
</p>
</div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> <span class="done DONE">DONE</span> Low time to interaction</h3>
<div class="outline-text-3" id="text-1-6">


</div>
