linked-data-outline.org
*** DONE Text

Because the service is driving the user interface, the time to
interaction must be low.

Research has shown that if the time to interaction is greater than
250ms the interface feels laggy.

If an application can not meet this requirement it is not a fun web
application.

250ms is the time to interaction but services must deliver payloads
much faster than that.

The application services team must monitor the latency of the network,
the backend, the application service and the time to interaction.

The application services team must place strict SLAs on the 95 and 99
percentiles of each component of the stack.

If these SLAs are violated the owner of the stack component must be
notified.

In addition, application services and clients must use HTTP caching
effectively and correctly.

HTTP caching must be as invisible to the developer as it is to a
user.

If we use caching and conditional GETs correctly, caching in
applications become simple.

Client developers will no longer need to worry about caching because
their libraries will do it for them.

When service implementors use HTTP caching correctly with conditional
GETs we can cut down on unnecessary processing and wasted bandwidth.

** DONE Internet-scale
*** DONE Slides
*** DONE Text
Finally; a web application must be Internet scale.  

Anarchic scalability means that we can share data in a distributed system.

Anarchic scalability requires using global identifiers for objects and 
property names.

If we use global identifiers for objects and property names we can
share data between the backend, application services and client
applications regardless of how large.

Independent Deployment means we can scale and deploy clients and
servers independently.

If we meet the requirement of independent deployment, frontend developers can
work with mocked data independently of service implementors.

To have Independent Deployment we must use a common language to
communicate. 

The common language of Web applications is HTML.

Web browsers and web sites can be deployed independently because they
use HTML.

However, native applications need more.

In order to drive native and web applications, application services
need to a global hypermedia based language.

** DONE Summary

These are the requirements of a web application.  They are also the
requirements of an application service.

If we want to meet these requirements, what do we have to do?

Lets examine a how a web application met these four requirements even
in the year 2000.

** DONE A true web application
*** DONE Slides
*** DONE Text    
HTML was built from the ground up to meet these four requirements.

How does HTML drive the user interface of multiple devices?

Let us become the user. 

First I want to browse stories about "Life, the Universe and
Everything".

So I tap on the life section link.

The link transforms me into a user that is now browsing the life section.

Immediately I say, "OMG Katy Perry" and tap on Katy Perry's face.

The link transforms me into a user that is now reading a story
about Katy Perry delivering a baby in someone's living room.

This is how HTML, the hypertext markup language, uses hypermedia
to drive the user interface.

** DONE Computer says no.
*** DONE Slides
*** DONE Text
Unfortunately this service can only drive HTML browsers.  

If we wanted to use this service to drive a mobile app, 
we would have to use a WebView.

The native app only sees links between HTML documents.

The native app has no knowledge of how to 
turn the sections and stories into native components.

This knowledge would have to be  hard coded into the app.

When knowledge is hardcoded it becomes tightly coupled to the
structure of the HTML.

So, what do we need?

Lets travel to the future and view source on an application
that can drive both web sites and native applications.

** DONE View Source
*** DONE Slides
*** DONE Text

Be honored, by traveling to the future, you may be the 
first person in history to see this.

In our time, we've heard legends of services like this.

Now, for the first time, we have documented proof of a future service
that can do things that seem impossible in our time.

We have a service that can drive both web sites *and* native applications.

What you see here is the raw data needed for each user state.

This raw data still has hypermedia links between the states so
a user can transition from one state to the other.

The raw data is typed with classes that the native application can use
to create native UI components

With this service we can drive desktop web, mobile web, mobile apps
and any future user agents.  

For instance, we could use this same service to build a TV app.  It
is the same interactions but a different presentation.

We could even use this service with an in dash system like Ford Sync.

Again, same interactions, just a different presentation.

We could even use this service to print a newspaper, A newspaper has
the same interaction model albeit on dead trees. 

Of course, in the future, this service does not drive such
applications

because TVs, cars and newspapers have been made obsolete by superior RESTful
services.

** DONE If these are the requirements
*** DONE Slide
*** DONE Text
Now back to our current time. 

If these are the requirements of this brave new world.

How can we make progress towards this future.

** DONE What is state?
*** DONE Slide
