linked-data-outline.html

<div id="outline-container-1-6-1" class="outline-4">
<h4 id="sec-1-6-1"><span class="section-number-4">1.6.1</span> <span class="done DONE">DONE</span> Slide</h4>
<div class="outline-text-4" id="text-1-6-1">

</div>

</div>

<div id="outline-container-1-6-2" class="outline-4">
<h4 id="sec-1-6-2"><span class="section-number-4">1.6.2</span> <span class="done DONE">DONE</span> Text</h4>
<div class="outline-text-4" id="text-1-6-2">


<p>
Because the service is driving the user interface, the time to
interaction must be low.
</p>
<p>
Research has shown that if the time to interaction is greater than
250ms the interface feels laggy.
</p>
<p>
If an application can not meet this requirement it is not a fun web
application.
</p>
<p>
250ms is the time to interaction but services must deliver payloads
much faster than that.
</p>
<p>
The application services team must monitor the latency of the network,
the backend, the application service and the time to interaction.
</p>
<p>
The application services team must place strict SLAs on the 95 and 99
percentiles of each component of the stack.
</p>
<p>
If these SLAs are violated the owner of the stack component must be
notified.
</p>
<p>
In addition, application services and clients must use HTTP caching
effectively and correctly.
</p>
<p>
HTTP caching must be as invisible to the developer as it is to a
user.
</p>
<p>
If we use caching and conditional GETs correctly, caching in
applications become simple.
</p>
<p>
Client developers will no longer need to worry about caching because
their libraries will do it for them.
</p>
<p>
When service implementors use HTTP caching correctly with conditional
GETs we can cut down on unnecessary processing and wasted bandwidth.
</p>
</div>
</div>

</div>

<div id="outline-container-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> <span class="done DONE">DONE</span> Internet-scale</h3>
<div class="outline-text-3" id="text-1-7">


</div>

<div id="outline-container-1-7-1" class="outline-4">
<h4 id="sec-1-7-1"><span class="section-number-4">1.7.1</span> <span class="done DONE">DONE</span> Slides</h4>
<div class="outline-text-4" id="text-1-7-1">

</div>

</div>

<div id="outline-container-1-7-2" class="outline-4">
<h4 id="sec-1-7-2"><span class="section-number-4">1.7.2</span> <span class="done DONE">DONE</span> Text</h4>
<div class="outline-text-4" id="text-1-7-2">

<p>Finally; a web application must be Internet scale.  
</p>
<p>
Anarchic scalability means that we can share data in a distributed system.
</p>
<p>
Anarchic scalability requires using global identifiers for objects and 
property names.
</p>
<p>
If we use global identifiers for objects and property names we can
share data between the backend, application services and client
applications regardless of how large.
</p>
<p>
Independent Deployment means we can scale and deploy clients and
servers independently.
</p>
<p>
If we meet the requirement of independent deployment, frontend developers can
work with mocked data independently of service implementors.
</p>
<p>
To have Independent Deployment we must use a common language to
communicate. 
</p>
<p>
The common language of Web applications is HTML.
</p>
<p>
Web browsers and web sites can be deployed independently because they
use HTML.
</p>
<p>
However, native applications need more.
</p>
<p>
In order to drive native and web applications, application services
need to a global hypermedia based language.
</p>
</div>
</div>

</div>

<div id="outline-container-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> <span class="done DONE">DONE</span> Summary</h3>
<div class="outline-text-3" id="text-1-8">


<p>
These are the requirements of a web application.  They are also the
requirements of an application service.
</p>
<p>
If we want to meet these requirements, what do we have to do?
</p>
<p>
Lets examine a how a web application met these four requirements even
in the year 2000.
</p>
</div>

</div>

<div id="outline-container-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> <span class="done DONE">DONE</span> A true web application</h3>
<div class="outline-text-3" id="text-1-9">


</div>

<div id="outline-container-1-9-1" class="outline-4">
<h4 id="sec-1-9-1"><span class="section-number-4">1.9.1</span> <span class="done DONE">DONE</span> Slides</h4>
<div class="outline-text-4" id="text-1-9-1">

</div>

</div>

<div id="outline-container-1-9-2" class="outline-4">
<h4 id="sec-1-9-2"><span class="section-number-4">1.9.2</span> <span class="done DONE">DONE</span> Text</h4>
<div class="outline-text-4" id="text-1-9-2">

<p>HTML was built from the ground up to meet these four requirements.
</p>
<p>
How does HTML drive the user interface of multiple devices?
</p>
<p>
Let us become the user. 
</p>
<p>
First I want to browse stories about "Life, the Universe and
Everything".
</p>
<p>
So I tap on the life section link.
</p>
<p>
The link transforms me into a user that is now browsing the life section.
</p>
<p>
Immediately I say, "OMG Katy Perry" and tap on Katy Perry's face.
</p>
<p>
The link transforms me into a user that is now reading a story
about Katy Perry delivering a baby in someone's living room.
</p>
<p>
This is how HTML, the hypertext markup language, uses hypermedia
to drive the user interface.
</p>
</div>
</div>

</div>

<div id="outline-container-1-10" class="outline-3">
<h3 id="sec-1-10"><span class="section-number-3">1.10</span> <span class="done DONE">DONE</span> Computer says no.</h3>
<div class="outline-text-3" id="text-1-10">


</div>

<div id="outline-container-1-10-1" class="outline-4">
<h4 id="sec-1-10-1"><span class="section-number-4">1.10.1</span> <span class="done DONE">DONE</span> Slides</h4>
<div class="outline-text-4" id="text-1-10-1">

</div>

</div>

<div id="outline-container-1-10-2" class="outline-4">
<h4 id="sec-1-10-2"><span class="section-number-4">1.10.2</span> <span class="done DONE">DONE</span> Text</h4>
<div class="outline-text-4" id="text-1-10-2">

<p>Unfortunately this service can only drive HTML browsers.  
</p>
<p>
If we wanted to use this service to drive a mobile app, 
we would have to use a WebView.
</p>
<p>
The native app only sees links between HTML documents.
</p>
<p>
The native app has no knowledge of how to 
turn the sections and stories into native components.
</p>
<p>
This knowledge would have to be  hard coded into the app.
</p>
<p>
When knowledge is hardcoded it becomes tightly coupled to the
structure of the HTML.
</p>
<p>
So, what do we need?
</p>
<p>
Lets travel to the future and view source on an application
that can drive both web sites and native applications.
</p>
</div>
</div>

</div>

<div id="outline-container-1-11" class="outline-3">
<h3 id="sec-1-11"><span class="section-number-3">1.11</span> <span class="done DONE">DONE</span> View Source</h3>
<div class="outline-text-3" id="text-1-11">


</div>

<div id="outline-container-1-11-1" class="outline-4">
<h4 id="sec-1-11-1"><span class="section-number-4">1.11.1</span> <span class="done DONE">DONE</span> Slides</h4>
<div class="outline-text-4" id="text-1-11-1">

</div>

</div>

<div id="outline-container-1-11-2" class="outline-4">
<h4 id="sec-1-11-2"><span class="section-number-4">1.11.2</span> <span class="done DONE">DONE</span> Text</h4>
<div class="outline-text-4" id="text-1-11-2">


<p>
Be honored, by traveling to the future, you may be the 
first person in history to see this.
</p>
<p>
In our time, we've heard legends of services like this.
</p>
<p>
Now, for the first time, we have documented proof of a future service
that can do things that seem impossible in our time.
</p>
<p>
We have a service that can drive both web sites <b>and</b> native applications.
</p>
<p>
What you see here is the raw data needed for each user state.
</p>
<p>
This raw data still has hypermedia links between the states so
a user can transition from one state to the other.
</p>
<p>
The raw data is typed with classes that the native application can use
to create native UI components
</p>
<p>
With this service we can drive desktop web, mobile web, mobile apps
and any future user agents.  
</p>
<p>
For instance, we could use this same service to build a TV app.  It
is the same interactions but a different presentation.
</p>
<p>
We could even use this service with an in dash system like Ford Sync.
</p>
<p>
Again, same interactions, just a different presentation.
</p>
<p>
We could even use this service to print a newspaper, A newspaper has
the same interaction model albeit on dead trees. 
</p>
<p>
Of course, in the future, this service does not drive such
applications
</p>
<p>
because TVs, cars and newspapers have been made obsolete by superior RESTful
services.
</p>
</div>
</div>

</div>

<div id="outline-container-1-12" class="outline-3">
<h3 id="sec-1-12"><span class="section-number-3">1.12</span> <span class="done DONE">DONE</span> If these are the requirements</h3>
<div class="outline-text-3" id="text-1-12">


</div>

<div id="outline-container-1-12-1" class="outline-4">
<h4 id="sec-1-12-1"><span class="section-number-4">1.12.1</span> <span class="done DONE">DONE</span> Slide</h4>
<div class="outline-text-4" id="text-1-12-1">

</div>

</div>

<div id="outline-container-1-12-2" class="outline-4">
<h4 id="sec-1-12-2"><span class="section-number-4">1.12.2</span> <span class="done DONE">DONE</span> Text</h4>
<div class="outline-text-4" id="text-1-12-2">

<p>Now back to our current time. 
</p>
<p>
If these are the requirements of this brave new world.
</p>
<p>
How can we make progress towards this future.
</p>
</div>
</div>

</div>

<div id="outline-container-1-13" class="outline-3">
<h3 id="sec-1-13"><span class="section-number-3">1.13</span> <span class="done DONE">DONE</span> What is state?</h3>
<div class="outline-text-3" id="text-1-13">


</div>
