linked-data-outline.org
*** DONE Text

The first thing we need to do is use the right definition
of "state".

When developers see the word "state" they immediately think data. So
the industry assigned URLs to data and thought they were done.

The definition of state in hypermedia is the state the user is in when
using our application. Hypermedia is just a site map.

So when developers misunderstand the definition of state, 

we misunderstood the importance of hypermedia 
and we ended up just having CRUD over HTTP and not REST.

** DONE Choosing the wrong data model
*** DONE Slides
*** DONE Text
The second thing the we need is a better data model.

Clearly we need a way to express data that is independent of the
service's chosen format.

Just as before with our HTML service, when knowledge has to be hard
coded into the app, the app becomes tightly coupled to structure of
the data model.

JSON and XML are both tree based data models.  

The object relationships are based on the shape of the tree. 

This means that clients are tightly coupled to the structure of the tree.

If a service needs to add a relationship between two objects 
it may drastically reshape the tree.

If the structure of the tree drastically changes and the app is
tightly coupled to the previous structure, the app will break.

We also need a global data model.

We need a data model that uses global identifiers for objects and
terms.

We need global identifiers in order to shared data in a distributed
system such as a client and server.

** DONE What can let us REST?
*** DONE Slides
*** DONE Text

Armed with the requirements of a web application and our new found
knowledge of a service from the future.

Can we meet these requirements with existing tools?

What can let us REST? 

What can drive native and web user agents, evolve effortlessly, be
responsive, and function at Internet scale?

Let us examine different approaches and assign gold stars to the
requirements that are met.  If we get all four gold stars, we have found
our solution.

** DONE Can JSON let us REST?
*** DONE Slides
*** DONE Text
Can JSON let us REST?

Can it drive both native and web user agents?

JSON has no native ability to control any device, so nope.

Can the service evolve? 

It can evolve in a limited way. We can add fields easily to the
objects but because it is tree based, we can't easily change
relationships between objects.

Is the UI responsive?  

Sure, but this is the participation award. HTTP gives us caching for
free. If we can download the objects in a single request we
get this star.

Is it web scale? 

No, the field names are local to the document.

If the tree is such a problem... let us take a cue from SQL and normalize. Let's try...

** DONE Can CSV let us REST?
*** DONE Slides
*** DONE Text
CSV.

CSV obviously is not hypermedia, so no star there.

Can the service evolve? 

Yes it actually can evolve quite nicely.  

We can add fields to the right without disrupting existing clients.

We can even add new relationships between objects without disrupting
existing clients. 

Gold star for extensibility.

Is the UI responsive?  

No, because there are two different files.

We have to make two HTTP requests to fetch them.

This is additional network latency.

Is it web scale? 

Nope.  The field names are local.  

They're even local to the files.

The author id is called "id" in the author table but it is called
"author_id" in the story table.

Even within these two files there are two names for the same concept.

So CSV is out, what else...

** DONE Can XML let us REST?
*** DONE Slides
*** DONE Text
XML, the extensible markup language.  The savior of data exchange.

Can we drive the user interface? 

Nope, no hypermedia in plain XML

Can the service evolve?

It is called the extensible markup language after all,

but it is as extensible as JSON is.  

We can add fields as much as we want. 

However it is tree based as well, so the structure is rigid.

Is the UI responsive?

Sure, you get the participation award, good job XML.

Is it web scale? 

Finally we have a format that is web scale. 

All the tags are namespaced, so they have global identifiers.  

We can also deploy client and servers independently because of XML
schemas.

Almost there, lets try to find the last one and a half stars somewhere.

** DONE Can HTML5 let us REST?
*** DONE Slides
*** DONE Text
The solution to XML's complexity, HTML5, can we use it to finally get
some REST?

Can we drive user agents? 

Well it is a hypertext markup language. Unfortunately we can only
drive HTML agents.

Can the service evolve? 

Again, a tree based structure, half a star.

Is it web scale?  

We actually lost this star because the field names of the HTML5 data
properties are local again.

Crap, we last half a star; Lets keep the hypermedia and try one of
those microdata things:

** DONE Can RDFa+HTML5 let us REST?
*** DONE Slides
