linked-data-outline.html

<div id="outline-container-1-13-1" class="outline-4">
<h4 id="sec-1-13-1"><span class="section-number-4">1.13.1</span> <span class="done DONE">DONE</span> Slide</h4>
<div class="outline-text-4" id="text-1-13-1">

</div>

</div>

<div id="outline-container-1-13-2" class="outline-4">
<h4 id="sec-1-13-2"><span class="section-number-4">1.13.2</span> <span class="done DONE">DONE</span> Text</h4>
<div class="outline-text-4" id="text-1-13-2">


<p>
The first thing we need to do is use the right definition
of "state".
</p>
<p>
When developers see the word "state" they immediately think data. So
the industry assigned URLs to data and thought they were done.
</p>
<p>
The definition of state in hypermedia is the state the user is in when
using our application. Hypermedia is just a site map.
</p>
<p>
So when developers misunderstand the definition of state, 
</p>
<p>
we misunderstood the importance of hypermedia 
and we ended up just having CRUD over HTTP and not REST.
</p>
</div>
</div>

</div>

<div id="outline-container-1-14" class="outline-3">
<h3 id="sec-1-14"><span class="section-number-3">1.14</span> <span class="done DONE">DONE</span> Choosing the wrong data model</h3>
<div class="outline-text-3" id="text-1-14">


</div>

<div id="outline-container-1-14-1" class="outline-4">
<h4 id="sec-1-14-1"><span class="section-number-4">1.14.1</span> <span class="done DONE">DONE</span> Slides</h4>
<div class="outline-text-4" id="text-1-14-1">

</div>

</div>

<div id="outline-container-1-14-2" class="outline-4">
<h4 id="sec-1-14-2"><span class="section-number-4">1.14.2</span> <span class="done DONE">DONE</span> Text</h4>
<div class="outline-text-4" id="text-1-14-2">

<p>The second thing the we need is a better data model.
</p>
<p>
Clearly we need a way to express data that is independent of the
service's chosen format.
</p>
<p>
Just as before with our HTML service, when knowledge has to be hard
coded into the app, the app becomes tightly coupled to structure of
the data model.
</p>
<p>
JSON and XML are both tree based data models.  
</p>
<p>
The object relationships are based on the shape of the tree. 
</p>
<p>
This means that clients are tightly coupled to the structure of the tree.
</p>
<p>
If a service needs to add a relationship between two objects 
it may drastically reshape the tree.
</p>
<p>
If the structure of the tree drastically changes and the app is
tightly coupled to the previous structure, the app will break.
</p>
<p>
We also need a global data model.
</p>
<p>
We need a data model that uses global identifiers for objects and
terms.
</p>
<p>
We need global identifiers in order to shared data in a distributed
system such as a client and server.
</p>
</div>
</div>

</div>

<div id="outline-container-1-15" class="outline-3">
<h3 id="sec-1-15"><span class="section-number-3">1.15</span> <span class="done DONE">DONE</span> What can let us REST?</h3>
<div class="outline-text-3" id="text-1-15">


</div>

<div id="outline-container-1-15-1" class="outline-4">
<h4 id="sec-1-15-1"><span class="section-number-4">1.15.1</span> <span class="done DONE">DONE</span> Slides</h4>
<div class="outline-text-4" id="text-1-15-1">

</div>

</div>

<div id="outline-container-1-15-2" class="outline-4">
<h4 id="sec-1-15-2"><span class="section-number-4">1.15.2</span> <span class="done DONE">DONE</span> Text</h4>
<div class="outline-text-4" id="text-1-15-2">


<p>
Armed with the requirements of a web application and our new found
knowledge of a service from the future.
</p>
<p>
Can we meet these requirements with existing tools?
</p>
<p>
What can let us REST? 
</p>
<p>
What can drive native and web user agents, evolve effortlessly, be
responsive, and function at Internet scale?
</p>
<p>
Let us examine different approaches and assign gold stars to the
requirements that are met.  If we get all four gold stars, we have found
our solution.
</p>
</div>
</div>

</div>

<div id="outline-container-1-16" class="outline-3">
<h3 id="sec-1-16"><span class="section-number-3">1.16</span> <span class="done DONE">DONE</span> Can JSON let us REST?</h3>
<div class="outline-text-3" id="text-1-16">


</div>

<div id="outline-container-1-16-1" class="outline-4">
<h4 id="sec-1-16-1"><span class="section-number-4">1.16.1</span> <span class="done DONE">DONE</span> Slides</h4>
<div class="outline-text-4" id="text-1-16-1">

</div>

</div>

<div id="outline-container-1-16-2" class="outline-4">
<h4 id="sec-1-16-2"><span class="section-number-4">1.16.2</span> <span class="done DONE">DONE</span> Text</h4>
<div class="outline-text-4" id="text-1-16-2">

<p>Can JSON let us REST?
</p>
<p>
Can it drive both native and web user agents?
</p>
<p>
JSON has no native ability to control any device, so nope.
</p>
<p>
Can the service evolve? 
</p>
<p>
It can evolve in a limited way. We can add fields easily to the
objects but because it is tree based, we can't easily change
relationships between objects.
</p>
<p>
Is the UI responsive?  
</p>
<p>
Sure, but this is the participation award. HTTP gives us caching for
free. If we can download the objects in a single request we
get this star.
</p>
<p>
Is it web scale? 
</p>
<p>
No, the field names are local to the document.
</p>
<p>
If the tree is such a problem&hellip; let us take a cue from SQL and normalize. Let's try&hellip;
</p>
</div>
</div>

</div>

<div id="outline-container-1-17" class="outline-3">
<h3 id="sec-1-17"><span class="section-number-3">1.17</span> <span class="done DONE">DONE</span> Can CSV let us REST?</h3>
<div class="outline-text-3" id="text-1-17">


</div>

<div id="outline-container-1-17-1" class="outline-4">
<h4 id="sec-1-17-1"><span class="section-number-4">1.17.1</span> <span class="done DONE">DONE</span> Slides</h4>
<div class="outline-text-4" id="text-1-17-1">

</div>

</div>

<div id="outline-container-1-17-2" class="outline-4">
<h4 id="sec-1-17-2"><span class="section-number-4">1.17.2</span> <span class="done DONE">DONE</span> Text</h4>
<div class="outline-text-4" id="text-1-17-2">

<p>CSV.
</p>
<p>
CSV obviously is not hypermedia, so no star there.
</p>
<p>
Can the service evolve? 
</p>
<p>
Yes it actually can evolve quite nicely.  
</p>
<p>
We can add fields to the right without disrupting existing clients.
</p>
<p>
We can even add new relationships between objects without disrupting
existing clients. 
</p>
<p>
Gold star for extensibility.
</p>
<p>
Is the UI responsive?  
</p>
<p>
No, because there are two different files.
</p>
<p>
We have to make two HTTP requests to fetch them.
</p>
<p>
This is additional network latency.
</p>
<p>
Is it web scale? 
</p>
<p>
Nope.  The field names are local.  
</p>
<p>
They're even local to the files.
</p>
<p>
The author id is called "id" in the author table but it is called
"author<sub>id</sub>" in the story table.
</p>
<p>
Even within these two files there are two names for the same concept.
</p>
<p>
So CSV is out, what else&hellip;
</p>
</div>
</div>

</div>

<div id="outline-container-1-18" class="outline-3">
<h3 id="sec-1-18"><span class="section-number-3">1.18</span> <span class="done DONE">DONE</span> Can XML let us REST?</h3>
<div class="outline-text-3" id="text-1-18">


</div>

<div id="outline-container-1-18-1" class="outline-4">
<h4 id="sec-1-18-1"><span class="section-number-4">1.18.1</span> <span class="done DONE">DONE</span> Slides</h4>
<div class="outline-text-4" id="text-1-18-1">

</div>

</div>

<div id="outline-container-1-18-2" class="outline-4">
<h4 id="sec-1-18-2"><span class="section-number-4">1.18.2</span> <span class="done DONE">DONE</span> Text</h4>
<div class="outline-text-4" id="text-1-18-2">

<p>XML, the extensible markup language.  The savior of data exchange.
</p>
<p>
Can we drive the user interface? 
</p>
<p>
Nope, no hypermedia in plain XML
</p>
<p>
Can the service evolve?
</p>
<p>
It is called the extensible markup language after all,
</p>
<p>
but it is as extensible as JSON is.  
</p>
<p>
We can add fields as much as we want. 
</p>
<p>
However it is tree based as well, so the structure is rigid.
</p>
<p>
Is the UI responsive?
</p>
<p>
Sure, you get the participation award, good job XML.
</p>
<p>
Is it web scale? 
</p>
<p>
Finally we have a format that is web scale. 
</p>
<p>
All the tags are namespaced, so they have global identifiers.  
</p>
<p>
We can also deploy client and servers independently because of XML
schemas.
</p>
<p>
Almost there, lets try to find the last one and a half stars somewhere.
</p>
</div>
</div>

</div>

<div id="outline-container-1-19" class="outline-3">
<h3 id="sec-1-19"><span class="section-number-3">1.19</span> <span class="done DONE">DONE</span> Can HTML5 let us REST?</h3>
<div class="outline-text-3" id="text-1-19">


</div>

<div id="outline-container-1-19-1" class="outline-4">
<h4 id="sec-1-19-1"><span class="section-number-4">1.19.1</span> <span class="done DONE">DONE</span> Slides</h4>
<div class="outline-text-4" id="text-1-19-1">

</div>

</div>

<div id="outline-container-1-19-2" class="outline-4">
<h4 id="sec-1-19-2"><span class="section-number-4">1.19.2</span> <span class="done DONE">DONE</span> Text</h4>
<div class="outline-text-4" id="text-1-19-2">

<p>The solution to XML's complexity, HTML5, can we use it to finally get
some REST?
</p>
<p>
Can we drive user agents? 
</p>
<p>
Well it is a hypertext markup language. Unfortunately we can only
drive HTML agents.
</p>
<p>
Can the service evolve? 
</p>
<p>
Again, a tree based structure, half a star.
</p>
<p>
Is it web scale?  
</p>
<p>
We actually lost this star because the field names of the HTML5 data
properties are local again.
</p>
<p>
Crap, we last half a star; Lets keep the hypermedia and try one of
those microdata things:
</p>
</div>
</div>

</div>

<div id="outline-container-1-20" class="outline-3">
<h3 id="sec-1-20"><span class="section-number-3">1.20</span> <span class="done DONE">DONE</span> Can RDFa+HTML5 let us REST?</h3>
<div class="outline-text-3" id="text-1-20">


</div>
