linked-data-outline.org
*** DONE Text

RDFa+HTML5, can this let us REST?

Can we drive multiple user agents? 

Yes! We have both raw data and hypermedia links, so gold star.

Can the service evolve? 

Yes, the data model is no longer tree based. The RDF data model is
graph based, we can freely add properties and relationships to objects
without disrupting other clients

Is the UI responsive? 

Many objects in one HTTP response, check.

Is it web scale? 

Can we share data globally?

Yes, the property names are global URIs

Can we deploy the client and server independently? 

Yes, RDF has vocabularies which can be the basis of independant
development.

We have our 4 stars, but can do use RDF without HTML5?

** DONE Can RDF let us REST?
*** DONE Slides
*** DONE Talk

If we get rid of HTML, Can we drive the UI with RDF?

We lost links but all the rest is still there. Can we put Links back
somehow?

** DONE A wild Hydra appears!
*** DONE Slides
*** DONE Text
Absolutely! Hydra is a vocabulary for RDF that lets us describe
a hypermedia driven service.

We can use Hydra to both drive HTML applications and native
applications. We win.

** DONE Not XML; please god no!
*** DONE Slides
*** DONE Text
But isn't RDF XML? 

Actually RDF is just a data model.  Saying RDF is XML is like saying
a tree is XML.

XML is just one way to serialize RDF.  So what is RDF then?

** DONE Triples?
*** DONE Slide
*** DONE Text
RDF is simply statements made about objects.  These statements are
often called triples.

They are made up of a subject, a predicate and an object just like an
English sentence.  So when I say, "Eric has a bike", "Eric" is the
subject, "has" is the predicate and "a bike" is the object.

The subject and predicate are always global URIs.  The object can
either be a URI, with establishes a relationship to another object or data such as
a string.

** DONE RDF is a graph 1
*** DONE Slide
*** DONE Text
So these statement build an RDF graph.  The RDF graph is a directed
graph that uses URI as its identifiers.

The good thing about a graph is that relationships can be added
without drastically changing the shape of the graph. 

** DONE RDF is a graph 2
*** DONE Slide
*** DONE Text
We just added a gannett:state relationship and the graph was
mostly undisturbed.

RDF also has the benefit of being normalized.  

In JSON if we had two stories with the same author, that author object
would be duplicated. This is not the case with RDF.

This will reduce payload sizes and save us money.

** DONE Can we finally get some REST?
*** DONE Slide
*** DONE Text
So with the addition of Hydra, We can drive multiple user agents with
a standard shared vocabulary.

In additon, the RDF data model is extremely simple to understand.  

It is just statements about objects. 

If we understand the web, we understand graphs.

So we have all four stars but we are just talking about a data model, not a data format.

We could use XML to serialize the graph but that requires clients to use RDF.

Is there a middle ground?

** DONE JSON-LD
*** DONE Slide
*** DONE Text
I wouldn't be asking that question if I didn't have an answers would I?

JSON-LD is a middle ground between using RDF natively and JSON idomatically.

With JSON-LD we can serialize an RDF graph, with all its wonderful properties,

or we can use JSON-LD as idomatic JSON for clients that are unaware of RDF.

This is great for retrofitting existing services without disturbing existing clients.

Using JSON-LD meets the requirement of safe evolution while adopting
Linked Data.

** DONE Linked Data
*** DONE Slides
*** DONE Text
So I have referred to Linked Data without actually defining it.

A fairly recent development in RDF is the concept of linked data.

Linked data is a set of constraints on RDF.

These benevolent constraints were made to foster sharing and documentation

While the goal is to build a large global database in the cloud; 

we can use the same ideas internally in our own services and reap the same
benefits.

We use HTTP links for terms that point to the definition of that term.

For instance, if you visit http://schema.org/Thing you will see the
definition of the class Thing.

This definition is both machine readable and human readable.

When building an RDF vocabulary, we specify it in RDF itself.

We can use this RDF graph to generate human readable documentation.

Another term I have failed to define up to now is the meaning of a
"Shared Vocabulary"; let me try to explain it.

** DONE Shared Vocabulary
*** DONE Slide
