linked-data-outline.html

<div id="outline-container-1-20-1" class="outline-4">
<h4 id="sec-1-20-1"><span class="section-number-4">1.20.1</span> <span class="done DONE">DONE</span> Slides</h4>
<div class="outline-text-4" id="text-1-20-1">

</div>

</div>

<div id="outline-container-1-20-2" class="outline-4">
<h4 id="sec-1-20-2"><span class="section-number-4">1.20.2</span> <span class="done DONE">DONE</span> Text</h4>
<div class="outline-text-4" id="text-1-20-2">


<p>
RDFa+HTML5, can this let us REST?
</p>
<p>
Can we drive multiple user agents? 
</p>
<p>
Yes! We have both raw data and hypermedia links, so gold star.
</p>
<p>
Can the service evolve? 
</p>
<p>
Yes, the data model is no longer tree based. The RDF data model is
graph based, we can freely add properties and relationships to objects
without disrupting other clients
</p>
<p>
Is the UI responsive? 
</p>
<p>
Many objects in one HTTP response, check.
</p>
<p>
Is it web scale? 
</p>
<p>
Can we share data globally?
</p>
<p>
Yes, the property names are global URIs
</p>
<p>
Can we deploy the client and server independently? 
</p>
<p>
Yes, RDF has vocabularies which can be the basis of independant
development.
</p>
<p>
We have our 4 stars, but can do use RDF without HTML5?
</p>
</div>
</div>

</div>

<div id="outline-container-1-21" class="outline-3">
<h3 id="sec-1-21"><span class="section-number-3">1.21</span> <span class="done DONE">DONE</span> Can RDF let us REST?</h3>
<div class="outline-text-3" id="text-1-21">


</div>

<div id="outline-container-1-21-1" class="outline-4">
<h4 id="sec-1-21-1"><span class="section-number-4">1.21.1</span> <span class="done DONE">DONE</span> Slides</h4>
<div class="outline-text-4" id="text-1-21-1">

</div>

</div>

<div id="outline-container-1-21-2" class="outline-4">
<h4 id="sec-1-21-2"><span class="section-number-4">1.21.2</span> <span class="done DONE">DONE</span> Talk</h4>
<div class="outline-text-4" id="text-1-21-2">


<p>
If we get rid of HTML, Can we drive the UI with RDF?
</p>
<p>
We lost links but all the rest is still there. Can we put Links back
somehow?
</p>
</div>
</div>

</div>

<div id="outline-container-1-22" class="outline-3">
<h3 id="sec-1-22"><span class="section-number-3">1.22</span> <span class="done DONE">DONE</span> A wild Hydra appears!</h3>
<div class="outline-text-3" id="text-1-22">


</div>

<div id="outline-container-1-22-1" class="outline-4">
<h4 id="sec-1-22-1"><span class="section-number-4">1.22.1</span> <span class="done DONE">DONE</span> Slides</h4>
<div class="outline-text-4" id="text-1-22-1">

</div>

</div>

<div id="outline-container-1-22-2" class="outline-4">
<h4 id="sec-1-22-2"><span class="section-number-4">1.22.2</span> <span class="done DONE">DONE</span> Text</h4>
<div class="outline-text-4" id="text-1-22-2">

<p>Absolutely! Hydra is a vocabulary for RDF that lets us describe
a hypermedia driven service.
</p>
<p>
We can use Hydra to both drive HTML applications and native
applications. We win.
</p>
</div>
</div>

</div>

<div id="outline-container-1-23" class="outline-3">
<h3 id="sec-1-23"><span class="section-number-3">1.23</span> <span class="done DONE">DONE</span> Not XML; please god no!</h3>
<div class="outline-text-3" id="text-1-23">


</div>

<div id="outline-container-1-23-1" class="outline-4">
<h4 id="sec-1-23-1"><span class="section-number-4">1.23.1</span> <span class="done DONE">DONE</span> Slides</h4>
<div class="outline-text-4" id="text-1-23-1">

</div>

</div>

<div id="outline-container-1-23-2" class="outline-4">
<h4 id="sec-1-23-2"><span class="section-number-4">1.23.2</span> <span class="done DONE">DONE</span> Text</h4>
<div class="outline-text-4" id="text-1-23-2">

<p>But isn't RDF XML? 
</p>
<p>
Actually RDF is just a data model.  Saying RDF is XML is like saying
a tree is XML.
</p>
<p>
XML is just one way to serialize RDF.  So what is RDF then?
</p>
</div>
</div>

</div>

<div id="outline-container-1-24" class="outline-3">
<h3 id="sec-1-24"><span class="section-number-3">1.24</span> <span class="done DONE">DONE</span> Triples?</h3>
<div class="outline-text-3" id="text-1-24">


</div>

<div id="outline-container-1-24-1" class="outline-4">
<h4 id="sec-1-24-1"><span class="section-number-4">1.24.1</span> <span class="done DONE">DONE</span> Slide</h4>
<div class="outline-text-4" id="text-1-24-1">

</div>

</div>

<div id="outline-container-1-24-2" class="outline-4">
<h4 id="sec-1-24-2"><span class="section-number-4">1.24.2</span> <span class="done DONE">DONE</span> Text</h4>
<div class="outline-text-4" id="text-1-24-2">

<p>RDF is simply statements made about objects.  These statements are
often called triples.
</p>
<p>
They are made up of a subject, a predicate and an object just like an
English sentence.  So when I say, "Eric has a bike", "Eric" is the
subject, "has" is the predicate and "a bike" is the object.
</p>
<p>
The subject and predicate are always global URIs.  The object can
either be a URI, with establishes a relationship to another object or data such as
a string.
</p>
</div>
</div>

</div>

<div id="outline-container-1-25" class="outline-3">
<h3 id="sec-1-25"><span class="section-number-3">1.25</span> <span class="done DONE">DONE</span> RDF is a graph 1</h3>
<div class="outline-text-3" id="text-1-25">


</div>

<div id="outline-container-1-25-1" class="outline-4">
<h4 id="sec-1-25-1"><span class="section-number-4">1.25.1</span> <span class="done DONE">DONE</span> Slide</h4>
<div class="outline-text-4" id="text-1-25-1">

</div>

</div>

<div id="outline-container-1-25-2" class="outline-4">
<h4 id="sec-1-25-2"><span class="section-number-4">1.25.2</span> <span class="done DONE">DONE</span> Text</h4>
<div class="outline-text-4" id="text-1-25-2">

<p>So these statement build an RDF graph.  The RDF graph is a directed
graph that uses URI as its identifiers.
</p>
<p>
The good thing about a graph is that relationships can be added
without drastically changing the shape of the graph. 
</p>
</div>
</div>

</div>

<div id="outline-container-1-26" class="outline-3">
<h3 id="sec-1-26"><span class="section-number-3">1.26</span> <span class="done DONE">DONE</span> RDF is a graph 2</h3>
<div class="outline-text-3" id="text-1-26">


</div>

<div id="outline-container-1-26-1" class="outline-4">
<h4 id="sec-1-26-1"><span class="section-number-4">1.26.1</span> <span class="done DONE">DONE</span> Slide</h4>
<div class="outline-text-4" id="text-1-26-1">

</div>

</div>

<div id="outline-container-1-26-2" class="outline-4">
<h4 id="sec-1-26-2"><span class="section-number-4">1.26.2</span> <span class="done DONE">DONE</span> Text</h4>
<div class="outline-text-4" id="text-1-26-2">

<p>We just added a gannett:state relationship and the graph was
mostly undisturbed.
</p>
<p>
RDF also has the benefit of being normalized.  
</p>
<p>
In JSON if we had two stories with the same author, that author object
would be duplicated. This is not the case with RDF.
</p>
<p>
This will reduce payload sizes and save us money.
</p>
</div>
</div>

</div>

<div id="outline-container-1-27" class="outline-3">
<h3 id="sec-1-27"><span class="section-number-3">1.27</span> <span class="done DONE">DONE</span> Can we finally get some REST?</h3>
<div class="outline-text-3" id="text-1-27">


</div>

<div id="outline-container-1-27-1" class="outline-4">
<h4 id="sec-1-27-1"><span class="section-number-4">1.27.1</span> <span class="done DONE">DONE</span> Slide</h4>
<div class="outline-text-4" id="text-1-27-1">

</div>

</div>

<div id="outline-container-1-27-2" class="outline-4">
<h4 id="sec-1-27-2"><span class="section-number-4">1.27.2</span> <span class="done DONE">DONE</span> Text</h4>
<div class="outline-text-4" id="text-1-27-2">

<p>So with the addition of Hydra, We can drive multiple user agents with
a standard shared vocabulary.
</p>
<p>
In additon, the RDF data model is extremely simple to understand.  
</p>
<p>
It is just statements about objects. 
</p>
<p>
If we understand the web, we understand graphs.
</p>
<p>
So we have all four stars but we are just talking about a data model, not a data format.
</p>
<p>
We could use XML to serialize the graph but that requires clients to use RDF.
</p>
<p>
Is there a middle ground?
</p>
</div>
</div>

</div>

<div id="outline-container-1-28" class="outline-3">
<h3 id="sec-1-28"><span class="section-number-3">1.28</span> <span class="done DONE">DONE</span> JSON-LD</h3>
<div class="outline-text-3" id="text-1-28">


</div>

<div id="outline-container-1-28-1" class="outline-4">
<h4 id="sec-1-28-1"><span class="section-number-4">1.28.1</span> <span class="done DONE">DONE</span> Slide</h4>
<div class="outline-text-4" id="text-1-28-1">

</div>

</div>

<div id="outline-container-1-28-2" class="outline-4">
<h4 id="sec-1-28-2"><span class="section-number-4">1.28.2</span> <span class="done DONE">DONE</span> Text</h4>
<div class="outline-text-4" id="text-1-28-2">

<p>I wouldn't be asking that question if I didn't have an answers would I?
</p>
<p>
JSON-LD is a middle ground between using RDF natively and JSON idomatically.
</p>
<p>
With JSON-LD we can serialize an RDF graph, with all its wonderful properties,
</p>
<p>
or we can use JSON-LD as idomatic JSON for clients that are unaware of RDF.
</p>
<p>
This is great for retrofitting existing services without disturbing existing clients.
</p>
<p>
Using JSON-LD meets the requirement of safe evolution while adopting
Linked Data.
</p>
</div>
</div>

</div>

<div id="outline-container-1-29" class="outline-3">
<h3 id="sec-1-29"><span class="section-number-3">1.29</span> <span class="done DONE">DONE</span> Linked Data</h3>
<div class="outline-text-3" id="text-1-29">


</div>

<div id="outline-container-1-29-1" class="outline-4">
<h4 id="sec-1-29-1"><span class="section-number-4">1.29.1</span> <span class="done DONE">DONE</span> Slides</h4>
<div class="outline-text-4" id="text-1-29-1">

</div>

</div>

<div id="outline-container-1-29-2" class="outline-4">
<h4 id="sec-1-29-2"><span class="section-number-4">1.29.2</span> <span class="done DONE">DONE</span> Text</h4>
<div class="outline-text-4" id="text-1-29-2">

<p>So I have referred to Linked Data without actually defining it.
</p>
<p>
A fairly recent development in RDF is the concept of linked data.
</p>
<p>
Linked data is a set of constraints on RDF.
</p>
<p>
These benevolent constraints were made to foster sharing and documentation
</p>
<p>
While the goal is to build a large global database in the cloud; 
</p>
<p>
we can use the same ideas internally in our own services and reap the same
benefits.
</p>
<p>
We use HTTP links for terms that point to the definition of that term.
</p>
<p>
For instance, if you visit <a href="http://schema.org/Thing">http://schema.org/Thing</a> you will see the
definition of the class Thing.
</p>
<p>
This definition is both machine readable and human readable.
</p>
<p>
When building an RDF vocabulary, we specify it in RDF itself.
</p>
<p>
We can use this RDF graph to generate human readable documentation.
</p>
<p>
Another term I have failed to define up to now is the meaning of a
"Shared Vocabulary"; let me try to explain it.
</p>
</div>
</div>

</div>
