linked-data-outline.org
*** DONE Text
Did you know what a meme was when you first saw the word?  

Did you even know how to pronounce it?  

Did you call a me-me or a mem?

You had to google it didn't you?  

Once you googled it you learned what a meme was.

Once you learned what a meme was you could talk about memes

** DONE Shared Vocabulary 2
*** DONE Slide
*** DONE Text
You could talk on Reddit about memes without soundly like an idiot.

Not sounding like an idiot is an important thing.

Computers need to not sound like idiots too.

Computers need to use shared vocabularies

Because if computers sound like idiots, they crash.

** DONE Shared Vocabulary 3
*** DONE Slide
*** DONE Text
A shared vocabulary is a set of properties and classes that define a
problem domain.

In the previous slide we used a schema.org vocabulary.

schema.org is a collection of very general terms that make up a common
shared vocabulary.

There are a lot of public vocabularies out there.  

A site called Linked Open Vocabularies has indexed over 400 public
vocabularies.

These are vocabularies that we can use when they match our problem
domain.

Public vocabularies are extremely important.

They are important for the same reason why a common language is
important.

If we didn't have a common language, we'd live in the Tower of Babel.

Without shared vocabularies we build distributed systems of Babel,
full of confusion.

** DONE Shared Vocabulary 3
*** DONE slide
*** DONE Text
Lets build a vocabulary to describe objects in our most popular
feed.

First, we start with a public vocabulary.  We start with schema.org's
CreativeWork class.

Schema.org's CreativeWork class has everything we need to talk about
any object in the most popular feed.

All we have to do is define what is unique to our problem domain.  

We define a gannett:Asset class which has an 'ssts' property.

You'll notice that the "Right Now" feed is a hetrogenious list of
assets.

These assets can be videos, stories, photos, or some future unknown
type.

As long as all objects in the right now feed are schema:CreativeWork
instances, 

we can display it with its image and title without making any change
to the template.

This is very powerful. 

In native application this is necessary if we want a library of
generic GUI controls.

For instance a ObjectiveC developers can make a control that is a
generic list of schema:CreativeWork objects.

These list controls are future proofed by the fact that all objects in
the feed will always be schema:CreativeWork objects. 

For safety sake, if any object in the feed is not of type
schema:CreativeWork the client should ignore it just like an HTML
browser ignores unknown tags.

This is incredible, this is amazing.  This is the freaking future and
it is 10 years old. Why are we not using it now?

** DONE With Linked Data
*** DONE Slide
*** DONE Text
I hope I was successful in expressing how important Linked Data is
for building RESTful services.

Linked Data lets us communicate about our data with clarity.

We can describe the properties of our objects in certain terms.

With JSON-LD we can retrofit existing services without disturbing
existing clients.

With global graphs we have the ability to evolve services safely.

And finally with Hydra, we can describe hypermedia services in the
clear language of linked data to drive any user agent.

If I accomplished anything with this talk,

I hope that I convince you to at least retrofit your services with JSON-LD

So that you can give meaning to meaningless services

** DONE We can finally get some REST
and we can finally get *some* REST. Thank you.

