linked-data-outline.html

<div id="outline-container-1-30" class="outline-3">
<h3 id="sec-1-30"><span class="section-number-3">1.30</span> <span class="done DONE">DONE</span> Shared Vocabulary</h3>
<div class="outline-text-3" id="text-1-30">


</div>

<div id="outline-container-1-30-1" class="outline-4">
<h4 id="sec-1-30-1"><span class="section-number-4">1.30.1</span> <span class="done DONE">DONE</span> Slide</h4>
<div class="outline-text-4" id="text-1-30-1">

</div>

</div>

<div id="outline-container-1-30-2" class="outline-4">
<h4 id="sec-1-30-2"><span class="section-number-4">1.30.2</span> <span class="done DONE">DONE</span> Text</h4>
<div class="outline-text-4" id="text-1-30-2">

<p>Did you know what a meme was when you first saw the word?  
</p>
<p>
Did you even know how to pronounce it?  
</p>
<p>
Did you call a me-me or a mem?
</p>
<p>
You had to google it didn't you?  
</p>
<p>
Once you googled it you learned what a meme was.
</p>
<p>
Once you learned what a meme was you could talk about memes
</p>
</div>
</div>

</div>

<div id="outline-container-1-31" class="outline-3">
<h3 id="sec-1-31"><span class="section-number-3">1.31</span> <span class="done DONE">DONE</span> Shared Vocabulary 2</h3>
<div class="outline-text-3" id="text-1-31">


</div>

<div id="outline-container-1-31-1" class="outline-4">
<h4 id="sec-1-31-1"><span class="section-number-4">1.31.1</span> <span class="done DONE">DONE</span> Slide</h4>
<div class="outline-text-4" id="text-1-31-1">

</div>

</div>

<div id="outline-container-1-31-2" class="outline-4">
<h4 id="sec-1-31-2"><span class="section-number-4">1.31.2</span> <span class="done DONE">DONE</span> Text</h4>
<div class="outline-text-4" id="text-1-31-2">

<p>You could talk on Reddit about memes without soundly like an idiot.
</p>
<p>
Not sounding like an idiot is an important thing.
</p>
<p>
Computers need to not sound like idiots too.
</p>
<p>
Computers need to use shared vocabularies
</p>
<p>
Because if computers sound like idiots, they crash.
</p>
</div>
</div>

</div>

<div id="outline-container-1-32" class="outline-3">
<h3 id="sec-1-32"><span class="section-number-3">1.32</span> <span class="done DONE">DONE</span> Shared Vocabulary 3</h3>
<div class="outline-text-3" id="text-1-32">


</div>

<div id="outline-container-1-32-1" class="outline-4">
<h4 id="sec-1-32-1"><span class="section-number-4">1.32.1</span> <span class="done DONE">DONE</span> Slide</h4>
<div class="outline-text-4" id="text-1-32-1">

</div>

</div>

<div id="outline-container-1-32-2" class="outline-4">
<h4 id="sec-1-32-2"><span class="section-number-4">1.32.2</span> <span class="done DONE">DONE</span> Text</h4>
<div class="outline-text-4" id="text-1-32-2">

<p>A shared vocabulary is a set of properties and classes that define a
problem domain.
</p>
<p>
In the previous slide we used a schema.org vocabulary.
</p>
<p>
schema.org is a collection of very general terms that make up a common
shared vocabulary.
</p>
<p>
There are a lot of public vocabularies out there.  
</p>
<p>
A site called Linked Open Vocabularies has indexed over 400 public
vocabularies.
</p>
<p>
These are vocabularies that we can use when they match our problem
domain.
</p>
<p>
Public vocabularies are extremely important.
</p>
<p>
They are important for the same reason why a common language is
important.
</p>
<p>
If we didn't have a common language, we'd live in the Tower of Babel.
</p>
<p>
Without shared vocabularies we build distributed systems of Babel,
full of confusion.
</p>
</div>
</div>

</div>

<div id="outline-container-1-33" class="outline-3">
<h3 id="sec-1-33"><span class="section-number-3">1.33</span> <span class="done DONE">DONE</span> Shared Vocabulary 3</h3>
<div class="outline-text-3" id="text-1-33">


</div>

<div id="outline-container-1-33-1" class="outline-4">
<h4 id="sec-1-33-1"><span class="section-number-4">1.33.1</span> <span class="done DONE">DONE</span> slide</h4>
<div class="outline-text-4" id="text-1-33-1">

</div>

</div>

<div id="outline-container-1-33-2" class="outline-4">
<h4 id="sec-1-33-2"><span class="section-number-4">1.33.2</span> <span class="done DONE">DONE</span> Text</h4>
<div class="outline-text-4" id="text-1-33-2">

<p>Lets build a vocabulary to describe objects in our most popular
feed.
</p>
<p>
First, we start with a public vocabulary.  We start with schema.org's
CreativeWork class.
</p>
<p>
Schema.org's CreativeWork class has everything we need to talk about
any object in the most popular feed.
</p>
<p>
All we have to do is define what is unique to our problem domain.  
</p>
<p>
We define a gannett:Asset class which has an 'ssts' property.
</p>
<p>
You'll notice that the "Right Now" feed is a hetrogenious list of
assets.
</p>
<p>
These assets can be videos, stories, photos, or some future unknown
type.
</p>
<p>
As long as all objects in the right now feed are schema:CreativeWork
instances, 
</p>
<p>
we can display it with its image and title without making any change
to the template.
</p>
<p>
This is very powerful. 
</p>
<p>
In native application this is necessary if we want a library of
generic GUI controls.
</p>
<p>
For instance a ObjectiveC developers can make a control that is a
generic list of schema:CreativeWork objects.
</p>
<p>
These list controls are future proofed by the fact that all objects in
the feed will always be schema:CreativeWork objects. 
</p>
<p>
For safety sake, if any object in the feed is not of type
schema:CreativeWork the client should ignore it just like an HTML
browser ignores unknown tags.
</p>
<p>
This is incredible, this is amazing.  This is the freaking future and
it is 10 years old. Why are we not using it now?
</p>
</div>
</div>

</div>

<div id="outline-container-1-34" class="outline-3">
<h3 id="sec-1-34"><span class="section-number-3">1.34</span> <span class="done DONE">DONE</span> With Linked Data</h3>
<div class="outline-text-3" id="text-1-34">


</div>

<div id="outline-container-1-34-1" class="outline-4">
<h4 id="sec-1-34-1"><span class="section-number-4">1.34.1</span> <span class="done DONE">DONE</span> Slide</h4>
<div class="outline-text-4" id="text-1-34-1">

</div>

</div>

<div id="outline-container-1-34-2" class="outline-4">
<h4 id="sec-1-34-2"><span class="section-number-4">1.34.2</span> <span class="done DONE">DONE</span> Text</h4>
<div class="outline-text-4" id="text-1-34-2">

<p>I hope I was successful in expressing how important Linked Data is
for building RESTful services.
</p>
<p>
Linked Data lets us communicate about our data with clarity.
</p>
<p>
We can describe the properties of our objects in certain terms.
</p>
<p>
With JSON-LD we can retrofit existing services without disturbing
existing clients.
</p>
<p>
With global graphs we have the ability to evolve services safely.
</p>
<p>
And finally with Hydra, we can describe hypermedia services in the
clear language of linked data to drive any user agent.
</p>
<p>
If I accomplished anything with this talk,
</p>
<p>
I hope that I convince you to at least retrofit your services with JSON-LD
</p>
<p>
So that you can give meaning to meaningless services
</p>
</div>
</div>

</div>

<div id="outline-container-1-35" class="outline-3">
<h3 id="sec-1-35"><span class="section-number-3">1.35</span> <span class="done DONE">DONE</span> We can finally get some REST</h3>
<div class="outline-text-3" id="text-1-35">

<p>and we can finally get <b>some</b> REST. Thank you.
</p>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-03-03T21:45-0500</p>
<p class="author">Author: Moritz</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
